module.exports = {
  singleQuote: true, // Использовать одинарные кавычки вместо двойных
  trailingComma: 'none', // Не добавлять запятые в конце списков и объектов
  tabWidth: 2, // Устанавливает ширину табуляции в 2 пробела
  useTabs: false, // Использовать пробелы вместо табуляций для отступов
  semi: true, // Добавлять точку с запятой в конце каждой строки
  printWidth: 80, // Устанавливает максимальную длину строки в 80 символов
  endOfLine: 'auto' // Автоматически определяет стиль окончания строки (CR, LF, CRLF) в зависимости от текущей операционной системы
};